app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all
---
SELECT `accounts`.* FROM `accounts`

  def show
    @account = Account.find(params[:id])
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1

  def edit
    @account = Account.find(params[:id])
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1

  def create
    @account = Account.new(params[:account])

    respond_to do |format|
      if @account.save
---
INSERT INTO `accounts` (`birthday`, `created_at`, `deskripsi`, `fee`, `income`, `login_time`, `premium`, `ranking`, `updated_at`, `user_name`) VALUES ('2014-12-03', '2014-12-03 03:02:29', 'adfadfdafadfdaf', NULL, NULL, '2014-12-03 03:02:00', 1, NULL, '2014-12-03 03:02:29', 'daf')

  def update
    @account = Account.find(params[:id])

    respond_to do |format|
      if @account.update_attributes(params[:account])
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
UPDATE `accounts` SET `deskripsi` = 'I\'m Getting an Error: I\'m developing a web with Facebook Integration.. I\'m new in ruby on rails. can you help with my problem.', `updated_at` = '2014-12-03 03:03:34' WHERE `accounts`.`id` = 2

  def destroy
    @account = Account.find(params[:id])
    @account.destroy
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
DELETE FROM `accounts` WHERE `accounts`.`id` = 1