app/controllers/users_controller.rb

  def index
	@user = User.all
---
SELECT `users`.* FROM `users`

  def show
    @user = User.all
---
SELECT `users`.* FROM `users`

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `encrypted_password`, `salt`, `updated_at`, `username`) VALUES ('2014-12-04 03:15:06', 'm4ssive@gmail.com', '$2a$10$X5aXbLmvAV7lr6aFi4hNvO/SnvR/DIgQtNcVsh8x5Ggniek9k1mW2', '$2a$10$X5aXbLmvAV7lr6aFi4hNvO', '2014-12-04 03:15:06', 'yudi')