app/views/accounts/show.html.erb

<p>Contact</p>
<% @account.contacts.each do |contact| %>
---
SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`account_id` = 2